// Ex. 1
let un = undefined;
alert("Значение переменно не определено - " + un);

// Ex. 2
let nu = null;
alert("Переменная с пустым значением - " + nu); 

// Ex. 3
let t = true;
alert("Значение истинной переменной - " + t);

// Ex. 4
let f = false;
alert("Значение ложной переменной - " + f);

// Ex. 5
let str1 = "oh, hi ";
let str2 = " Mark";
alert("Произведение не чисел - " + (str1 * str2));

// Ex. 6
alert("Попытка поделить положительное число на ноль - " + (10 / 0));

// Ex. 7
alert("Попытка поделить отрицательное число на ноль - " + (-10 / 0));