/* Ex. 1
let a = 5 + 5 * 3;
alert(a); */
alert("Упражнение №1. На экран выведется число 20.");

/* Ex. 2 
let a = 5 + 5 * 3 + 3;
alert(a); */
alert("Упражнение №2. На экран выведется число 23.");

/* Ex. 3 
let a = 8 / 2 + 2;
alert(a); */
alert("Упражнение №3. На экран выведется число 6.");

/* Ex. 4 
let a = 8 + 2 / 2;
alert(a); */
alert("Упражнение №4. На экран выведется число 8.");

/* Ex. 5 
let a = 8 / 2 * 2;
alert(a); */
alert("Упражнение №5. Так как действия умножения и деления имеют равный приоритет, и выполняются по порядку слева направо, то на экран выведется число 8.");

/* Ex. 6 
let a = 8 * 4 / 2 / 2;
alert(a); */
alert("Упражнение №6. Так как действия умножения и деления имеют равный приоритет, и выполняются по порядку слева направо, то на экран выведется число 8.");

/* Ex. 7 
let a = (2 + 3) * (2 + 3);
alert(a); */
alert("Упражнение №7. Так как с помощью скобок можно задавать действиям больший приоритет(т.е. сначала выполниться то действие, которое в скобках), то на экран выведется число 25.");

/* Ex. 8 
let a = (2 + 3) * 2 + 3;
alert(a); */
alert("Упражнение №8. Так как с помощью скобок можно задавать действиям больший приоритет(т.е. сначала выполниться то действие, которое в скобках), то на экран выведется число 25.");

/* Ex. 9 
let a = 2 * (2 + 4 * (3 + 1));
alert(a); */
alert("Упражнение №9. Так как с помощью скобок можно задавать действиям больший приоритет(т.е. сначала выполниться то действие, которое в скобках), то на экран выведется число 36.");

/* Ex. 10 
let a = 2 * 8 / 4;
alert(a); */
alert("Упражнение №10. Так как с помощью скобок можно задавать действиям больший приоритет(т.е. сначала выполниться то действие, которое в скобках), то на экран выведется число 4.");

/* Ex. 11 
let a = (2 * 8) / 4;
alert(a); */
alert("Упражнение №11. Так как с помощью скобок можно задавать действиям больший приоритет(т.е. сначала выполниться то действие, которое в скобках), то на экран выведется число 4.");

/* Ex. 12  
let a = 2 * (8 / 4);
alert(a); */
alert("Упражнение №12. Так как с помощью скобок можно задавать действиям больший приоритет(т.е. сначала выполниться то действие, которое в скобках), то на экран выведется число 4.");
