/* Ex. 1
let a = '5' + '2';
alert(a); */
alert("Упражнение №1. Выведет '52'");

/* Ex. 2 
let a = '5' + 2;
alert(a); */
alert("Упражнение №2. Выведет '52'");

/* Ex. 3 
let a = 5 + '2';
alert(a); */
alert("Упражнение №3.Выведет '52'");

/* Ex. 4 
let a = 5 + 2;
alert(a); */
alert("Упражнение №4.Выведет 7");

/* Ex. 5 
let a = '5' * '2';
alert(a); */
alert("Упражнение №5. Выведет 10");

/* Ex. 6 
let a = '5' - '2';
alert(a); */
alert("Упражнение №6. Выведет 3");

/* Ex. 7 
let a = '5' / '2';
alert(a); */
alert("Упражнение №7. Выведет 2.5");

/* Ex. 8 
let a = '5' % '2';
alert(a); */
alert("Упражнение №8. 1");

/* Ex. 9 
let a = '5s' * '2';
alert(a); */
alert("Упражнение №9. NaN");

/* Ex. 10 
let a = '5s' + '2';
alert(a); */
alert("Упражнение №10. '5s2'");

/* Ex. 11 
let a = (-'5') + (-'2');
alert(a); */
alert("Упражнение №11. -7");

/* Ex. 12  
let a = '5' * 1 + '2' * 1;
alert(a); */
alert("Упражнение №12. 7");

/* Ex. 13  
let a = '5' * '1' + '2' * '1';
alert(a); */
alert("Упражнение №13. 7");

/* Ex. 14
let a = '' + 3 + 1;
alert(a); */
alert("Упражнение №14. '31'");