// Ex. 1
let a = 10;
let b = 2;
alert("Упражнение №1. Сумма переменных: " + (a+b) + ';    ' + "Разность переменных: " + (a-b) + ';    ' + "Произведение переменных: " + (a*b) + ';    ' + "Частное переменных: " + (a/b) + ';');

// Ex. 2
let c = 10;
let d = 5;
let result = a + b;
alert("Упражнение №2. Значение перменной равно: " + result);

// Ex. 3
let a2 = 1;
let b2 = 2;
let c2 = 3;
alert("Упражнение №3. Сумма переменных равна: " + (a+b+c));

// Ex. 4
let a3 = 10;
let b3 = 5;
let c3 = a3 - b3;
let d3 = 7;
let result1 = c3 + d3;
alert("Упражнение №4. Значение перменной равно: " + result);