// Ex. 1
let a = 2;
alert("Упражнение №1. Результат возведения числа 2 в 10 степень " + (a**10));

/* Ex. 2 
let a = 3 * 2 ** 3;
alert(a); */
alert("Упражнение №2. Так как операция возведния в степень имеет приоритет выше чем умножение и деление(т.е. она будет выполнятся самой первой), то на экран выведется число 24.");

/* Ex. 3 
let a = (3 * 2) ** 3;
alert(a); */
alert("Упражнение №3. Так как с помощью скобок можно менять порядок выполнения операция, то на экран выведется число 216.");

/* Ex. 4 
let a = 3 * 2 ** (3 + 1);
alert(a); */
alert("Упражнение №4. Так как с помощью скобок можно менять порядок выполнения операция, то на экран выведется число 48.");

/* Ex. 5 
let a = 2 ** 3 * 3;
alert(a); */
alert("Упражнение №5. Так как операция возведния в степень имеет приоритет выше чем умножение и деление(т.е. она будет выполнятся самой первой), то на экран выведется число 24.");

/* Ex. 6 
let a1 = 3 * 2 ** 3 * 3;
alert(a1); */
alert("Упражнение №6. Так как операция возведния в степень имеет приоритет выше чем умножение и деление(т.е. она будет выполнятся самой первой), то на экран выведется число 72.");
